# Data Analysis using Pandas

In [1]:
import pandas as pd #import pandas library as pd

In [2]:
#creating a sample database with help of dictionary

dict1 = {'Name': ['Anand', 'Aadhya','Nishti','Vedant','Pankaj','Mitali','Archana'],
        'Marks': [98,89,99,87,90,83,99],
         'Gender': ['Male','Female','Female','Male','Male','Female','Female']}

In [3]:
df1= pd.DataFrame(dict1)
df1                    #calling database via pandas dataframe

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

### 1. Display top 3 Rows of the Dataset

In [4]:
df1.head()   #it will display top 5 data

     Name  Marks  Gender
0   Anand     98    Male
1  Aadhya     89  Female
2  Nishti     99  Female
3  Vedant     87    Male
4  Pankaj     90    Male

In [5]:
df1.head(3)

     Name  Marks  Gender
0   Anand     98    Male
1  Aadhya     89  Female
2  Nishti     99  Female

### 2. Display last 3 Rows of the Dataset

In [6]:
df1.tail()  #it will display last 5 data

      Name  Marks  Gender
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

### Find shape of dataset (Number of Rows and Number of Columns)

In [8]:
df1.shape     #shape is not a method its attribute

(7, 3)

In [9]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

### Find complete information about dataset , ex- Rows, Columns , Datatypes, and others.

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### Check Null values in the Dataset

In [11]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [12]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df1.isnull().sum(axis = 1) #Rowswise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [14]:
df1.isnull().sum(axis = 0) #columnswise

Name      0
Marks     0
Gender    0
dtype: int64

### Get overall Statistics about the Dataframe

In [15]:
df1.describe()  #statistics of the numerical values only

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [16]:
df1.describe(include = 'all')  #statistics of the all(numerical & categorical) values only

         Name      Marks  Gender
count       7   7.000000       7
unique      7        NaN       2
top     Anand        NaN  Female
freq        1        NaN       4
mean      NaN  92.142857     NaN
std       NaN   6.491753     NaN
min       NaN  83.000000     NaN
25%       NaN  88.000000     NaN
50%       NaN  90.000000     NaN
75%       NaN  98.500000     NaN
max       NaN  99.000000     NaN

### Find uniques values from the Gender columns

In [17]:
df1

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [18]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [19]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### Find the number of unique value from the Gender column

In [20]:
df1['Gender'].nunique()

2

### Display count of unique values in Gender column

In [21]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### Find total number of Students having marks between 90 to 100 (Inclusve) using between method

In [22]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [23]:
df1['Marks'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [24]:
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0    Anand     98    Male
2   Nishti     99  Female
4   Pankaj     90    Male
6  Archana     99  Female

In [25]:
(df1['Marks'] >= 90) &  (df1['Marks'] <= 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [26]:
#passing the above condition in dataframe  >>>df1[]
df1[(df1['Marks'] >= 90) &  (df1['Marks'] <= 100)]

      Name  Marks  Gender
0    Anand     98    Male
2   Nishti     99  Female
4   Pankaj     90    Male
6  Archana     99  Female

In [27]:
len(df1[(df1['Marks'] >= 90) &  (df1['Marks'] <= 100)])   #counting number of student b/w 90 to 100

4

In [28]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [29]:
sum(df1['Marks'].between(90,100))

4

### Find Average marks

In [30]:
df1

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [31]:
df1['Marks'].mean()

92.14285714285714

In [32]:
df1['Marks'].min()

83

In [33]:
df1['Marks'].max()

99

In [34]:
df1['Marks'].median()

90.0

In [35]:
df1['Marks'].mode()

0    99
dtype: int64

### Apply method

In [36]:
def marks(x):
    return x/2

In [37]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [38]:
#adding this in the data frame
df1['Half_marks'] = df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0    Anand     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Nishti     99  Female        49.5
3   Vedant     87    Male        43.5
4   Pankaj     90    Male        45.0
5   Mitali     83  Female        41.5
6  Archana     99  Female        49.5

In [39]:
#lambda functions
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

### Map function

In [40]:
df1['Gender_num']= df1['Gender'].map({'Male':1, 'Female':0})

In [41]:
df1

      Name  Marks  Gender  Half_marks  Gender_num
0    Anand     98    Male        49.0           1
1   Aadhya     89  Female        44.5           0
2   Nishti     99  Female        49.5           0
3   Vedant     87    Male        43.5           1
4   Pankaj     90    Male        45.0           1
5   Mitali     83  Female        41.5           0
6  Archana     99  Female        49.5           0

### Drop the Columns

In [42]:
df1

      Name  Marks  Gender  Half_marks  Gender_num
0    Anand     98    Male        49.0           1
1   Aadhya     89  Female        44.5           0
2   Nishti     99  Female        49.5           0
3   Vedant     87    Male        43.5           1
4   Pankaj     90    Male        45.0           1
5   Mitali     83  Female        41.5           0
6  Archana     99  Female        49.5           0

In [43]:
df1.drop('Gender_num', axis=1)

      Name  Marks  Gender  Half_marks
0    Anand     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Nishti     99  Female        49.5
3   Vedant     87    Male        43.5
4   Pankaj     90    Male        45.0
5   Mitali     83  Female        41.5
6  Archana     99  Female        49.5

In [44]:
df1.drop(['Gender_num','Half_marks'], axis=1)

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [45]:
df1

      Name  Marks  Gender  Half_marks  Gender_num
0    Anand     98    Male        49.0           1
1   Aadhya     89  Female        44.5           0
2   Nishti     99  Female        49.5           0
3   Vedant     87    Male        43.5           1
4   Pankaj     90    Male        45.0           1
5   Mitali     83  Female        41.5           0
6  Archana     99  Female        49.5           0

In [46]:
df1.drop(['Gender_num','Half_marks'], axis=1, inplace = True)

In [47]:
df1

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

### Print Name of the Columns

In [48]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [49]:
df1.index

RangeIndex(start=0, stop=7, step=1)

### Sort the dataframe as per the marks Column

In [50]:
df1    #Display the dataframe

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [51]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mitali     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Pankaj     90    Male
0    Anand     98    Male
2   Nishti     99  Female
6  Archana     99  Female

In [52]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Nishti     99  Female
6  Archana     99  Female
0    Anand     98    Male
4   Pankaj     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mitali     83  Female

### Display the name & marks of the Female Students

In [53]:
df1

      Name  Marks  Gender
0    Anand     98    Male
1   Aadhya     89  Female
2   Nishti     99  Female
3   Vedant     87    Male
4   Pankaj     90    Male
5   Mitali     83  Female
6  Archana     99  Female

In [54]:
df1['Gender']== 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [55]:
df1[df1['Gender']== 'Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Nishti     99  Female
5   Mitali     83  Female
6  Archana     99  Female

In [56]:
df1[df1['Gender']== 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Nishti     99
5   Mitali     83
6  Archana     99

In [57]:
df1['Gender'].isin(['Female'])   #Inbuilt method

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [58]:
df1[df1['Gender'].isin(['Female']) ]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Nishti     99  Female
5   Mitali     83  Female
6  Archana     99  Female

In [59]:
df1[df1['Gender'].isin(['Female']) ][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Nishti     99
5   Mitali     83
6  Archana     99